#replace()..to replace existing values in dataframe with other value

In [1]:
import pandas as pd

In [4]:
df=pd.read_csv('D:\\Movies\\BOLLYWOOD\\Flames\\book.csv')
df

   id name  industry  profit
0   1    a    health      10
1   2    b    health      20
2   3    c  security      30
3   4    d    worker      30
4   5    e     water      40

In [5]:
df.replace(to_replace='health',value='mobile')

   id name  industry  profit
0   1    a    mobile      10
1   2    b    mobile      20
2   3    c  security      30
3   4    d    worker      30
4   5    e     water      40

In [6]:
df.replace('health','mobile')  #df.replace(old,new)

   id name  industry  profit
0   1    a    mobile      10
1   2    b    mobile      20
2   3    c  security      30
3   4    d    worker      30
4   5    e     water      40

#by using list

In [7]:
df.replace([1,2,3,4,5],8)

   id name  industry  profit
0   8    a    health      10
1   8    b    health      20
2   8    c  security      30
3   8    d    worker      30
4   8    e     water      40

In [9]:
df.replace([1,2,3,4,5],[7,8,9,10,11])

   id name  industry  profit
0   7    a    health      10
1   8    b    health      20
2   9    c  security      30
3  10    d    worker      30
4  11    e     water      40

#to change the value of particular column

In [11]:
df

   id name  industry  profit
0   1    a    health      10
1   2    b    health      20
2   3    c  security      30
3   4    d    worker      30
4   5    e     water      40

In [13]:
df.replace({'industry':'health','profit':30},'good')

   id name  industry profit
0   1    a      good     10
1   2    b      good     20
2   3    c  security   good
3   4    d    worker   good
4   5    e     water     40

#to change the all string with given input by finding pattern using regex

In [15]:
df.replace('[A-Za-z]',0)

   id name  industry  profit
0   1    a    health      10
1   2    b    health      20
2   3    c  security      30
3   4    d    worker      30
4   5    e     water      40

In [16]:
#using regex()..to detect pattern recognition
df.replace('[A-Za-z]',0,regex=True)

   id  name  industry  profit
0   1     0         0      10
1   2     0         0      20
2   3     0         0      30
3   4     0         0      30
4   5     0         0      40

#regex for paticular column so use dictionary

In [19]:
df.replace({'industry':'[A-Za-z]'},'aman',regex=True)

   id name                          industry  profit
0   1    a          amanamanamanamanamanaman      10
1   2    b          amanamanamanamanamanaman      20
2   3    c  amanamanamanamanamanamanamanaman      30
3   4    d          amanamanamanamanamanaman      30
4   5    e              amanamanamanamanaman      40

In [20]:
df.replace({'industry':'[A-Za-z]'},5,regex=True)

   id name  industry  profit
0   1    a         5      10
1   2    b         5      20
2   3    c         5      30
3   4    d         5      30
4   5    e         5      40

#method()..fills with forward values

In [21]:
df

   id name  industry  profit
0   1    a    health      10
1   2    b    health      20
2   3    c  security      30
3   4    d    worker      30
4   5    e     water      40

In [22]:
df.replace('security',method='ffill')

C:\Users\AS\AppData\Local\Temp\ipykernel_18180\1253718641.py:1: FutureWarning: The 'method' keyword in DataFrame.replace is deprecated and will be removed in a future version.
  df.replace('security',method='ffill')

   id name industry  profit
0   1    a   health      10
1   2    b   health      20
2   3    c   health      30
3   4    d   worker      30
4   5    e    water      40

In [23]:
df.replace('security',method='bfill')

C:\Users\AS\AppData\Local\Temp\ipykernel_18180\1798585607.py:1: FutureWarning: The 'method' keyword in DataFrame.replace is deprecated and will be removed in a future version.
  df.replace('security',method='bfill')

   id name industry  profit
0   1    a   health      10
1   2    b   health      20
2   3    c   worker      30
3   4    d   worker      30
4   5    e    water      40

In [24]:
df.replace(30,method='ffill',limit=1)

C:\Users\AS\AppData\Local\Temp\ipykernel_18180\4234840701.py:1: FutureWarning: The 'method' keyword in DataFrame.replace is deprecated and will be removed in a future version.
  df.replace(30,method='ffill',limit=1)

   id name  industry  profit
0   1    a    health      10
1   2    b    health      20
2   3    c  security      20
3   4    d    worker      30
4   5    e     water      40

#inplace()..it does not create new datafrane it modifys in old dataframe...replace(old,new,inplace=True)

In [29]:
df.replace('health','jio',inplace=True)
df

   id name  industry  profit
0   1    a       jio      10
1   2    b       jio      20
2   3    c  security      30
3   4    d    worker      30
4   5    e     water      40

In [26]:
df

   id name  industry  profit
0   1    a       jio      10
1   2    b       jio      20
2   3    c  security      30
3   4    d    worker      30
4   5    e     water      40